In [7]:
import tarfile
import os
import pandas as pd

In [6]:
!wget -nc https://storage.googleapis.com/gresearch/dakshina/dakshina_dataset_v1.0.tar

if not os.path.isdir('/content/dakshina_dataset_v1.0'):
  tarfile.open("/content/dakshina_dataset_v1.0.tar").extractall()

File ‘dakshina_dataset_v1.0.tar’ already there; not retrieving.

# Lexicons

In [8]:
ta_lex = dict()
ta_lex['train'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/lexicons/ta.translit.sampled.train.tsv', sep='\t', header=None)
ta_lex['dev'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/lexicons/ta.translit.sampled.dev.tsv', sep='\t', header=None)
ta_lex['test'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/lexicons/ta.translit.sampled.test.tsv', sep='\t', header=None)

In [9]:
ta_lex['train']

          ஃபியட்     fiat  2
0         ஃபியட்   phiyat  1
1         ஃபியட்    piyat  1
2      ஃபிரான்ஸ்  firaans  1
3      ஃபிரான்ஸ்   france  2
4      ஃபிரான்ஸ்  francis  1
...          ...      ... ..
68212     ஹோல்ட்    holtt  1
68213     ஹோல்ட்    hoold  1
68214     ஹோல்ட்    hoolt  1
68215     ஹோல்ட்   hooltt  1
68216     ஹோல்ட்     hult  1

[68217 rows x 3 columns]

# Romanized

In [19]:
ta_rom = dict()
ta_rom['rejoined'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/romanized/ta.romanized.rejoined.tsv', sep='\t', header=None, error_bad_lines=False)
ta_rom['rejoined_aligned_cased'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/romanized/ta.romanized.rejoined.aligned.cased_nopunct.tsv', sep='\t', header=None, error_bad_lines=False) 
ta_rom['rejoined_aligned'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/romanized/ta.romanized.rejoined.aligned.tsv', sep='\t', header=None, error_bad_lines=False)
ta_rom['split'] = pd.read_csv('/content/dakshina_dataset_v1.0/ta/romanized/ta.romanized.split.tsv', sep='\t', header=None, error_bad_lines=False)

b'Skipping line 1096: expected 2 fields, saw 3\nSkipping line 1581: expected 2 fields, saw 3\n'
b'Skipping line 33794: expected 2 fields, saw 3\nSkipping line 33795: expected 2 fields, saw 3\nSkipping line 33796: expected 2 fields, saw 3\nSkipping line 33798: expected 2 fields, saw 3\nSkipping line 33799: expected 2 fields, saw 3\nSkipping line 33801: expected 2 fields, saw 3\nSkipping line 33802: expected 2 fields, saw 3\nSkipping line 33803: expected 2 fields, saw 3\n'
b'Skipping line 11317: expected 2 fields, saw 4\nSkipping line 16502: expected 2 fields, saw 4\nSkipping line 32577: expected 2 fields, saw 3\nSkipping line 32578: expected 2 fields, saw 3\nSkipping line 32579: expected 2 fields, saw 3\nSkipping line 32581: expected 2 fields, saw 3\nSkipping line 32582: expected 2 fields, saw 3\nSkipping line 32584: expected 2 fields, saw 3\nSkipping line 32585: expected 2 fields, saw 3\nSkipping line 32586: expected 2 fields, saw 3\n'
b'Skipping line 1108: expected 7 fields, saw 9\nSkipping line 1597: expected 7 fields, saw 9\n'

In [15]:
ta_rom['rejoined']

                                                      0                                                  1
0     ரேடியோ அதிர்வெண் முடுக்கிகள், துகள்கள் நேரடியா...  Radio athirven mudikkigal, thugalkal neradiyag...
1     மான் விளையாடிக்கொண்டு வந்து உன்னை மோதினால் உன்...  Maan vilaiyaadikondu vanthu unnai modhinaal un...
2                                             அமிர்தகழி                                       Amirthakazhi
3     மோகன் லால் குப்தா ஜெய்ப்பூரின் முன்னாள் மேயராக...  Mohan Lal Gupta Jaipaurin munnal mayoragavum, ...
4                      தில்லி மாநில கூட்டுறவு வங்கி லி.                  Delhi maanila kooturavu vangi li.
...                                                 ...                                                ...
9897  என்றாலும் வில்லியம் இறந்த பிறகான கரோலினின் பணி...  Yendraalum William irandha piragaana Carolinin...
9898  தொல்பொருளியல் அச்சகம் (Archaeopress) என்பது இங...  Tholporuliyal achchagam (Archaeopress) yenbath...
9899  மலைய நாட்டு மன்னனை மலாடர் கோமான் என்று சங்கப்ப...  Malaiya naattu mannanai malaadar komaan yendru...
9900  அப்படையின் தொகை மிக அருகி இருந்ததோடு, அதனிடம் ...  Appadaiyin thogai miga arugi irunthathodu, ath...
9901  தொண்டன் இலங்கை, திருகோணமலையிலிருந்து 1970ம் ஆண...  Thondan ilangai, thirukonanmalaiyilirundhu 197...

[9902 rows x 2 columns]

In [20]:
ta_rom['rejoined_aligned_cased']

                  0            1
0            ரேடியோ        radio
1         அதிர்வெண்     athirven
2       முடுக்கிகள்   mudikkigal
3          துகள்கள்    thugalkal
4          நேரடியாக   neradiyaga
...             ...          ...
104779   இவ்விதழின்  ivvithazhin
104780         விலை        vilai
104781       ரூபாய்      roobaay
104782         1.00         1.00
104783         </s>         </s>

[104784 rows x 2 columns]

In [18]:
ta_rom['rejoined_aligned']

                   0            1
0             ரேடியோ        Radio
1          அதிர்வெண்     athirven
2       முடுக்கிகள்,  mudikkigal,
3           துகள்கள்    thugalkal
4           நேரடியாக   neradiyaga
...              ...          ...
103538    இவ்விதழின்  ivvithazhin
103539          விலை        vilai
103540        ரூபாய்      roobaay
103541          1.00         1.00
103542          </s>         </s>

[103543 rows x 2 columns]

In [16]:
ta_rom['split']

                                                      0   1  ...   5    6
0     ரேடியோ அதிர்வெண் முடுக்கிகள், துகள்கள் நேரடியா...   6  ... NaN  NaN
1     மான் விளையாடிக்கொண்டு வந்து உன்னை மோதினால் உன்...  21  ... NaN  NaN
2                                             அமிர்தகழி   1  ... NaN  NaN
3     மோகன் லால் குப்தா ஜெய்ப்பூரின் முன்னாள் மேயராக...  12  ... NaN  NaN
4                      தில்லி மாநில கூட்டுறவு வங்கி லி.   5  ... NaN  NaN
...                                                 ...  ..  ...  ..  ...
9982  என்றாலும் வில்லியம் இறந்த பிறகான கரோலினின் பணி...  27  ... NaN  NaN
9983  தொல்பொருளியல் அச்சகம் (Archaeopress) என்பது இங...  14  ... NaN  NaN
9984  மலைய நாட்டு மன்னனை மலாடர் கோமான் என்று சங்கப்ப...   8  ... NaN  NaN
9985  அப்படையின் தொகை மிக அருகி இருந்ததோடு, அதனிடம் ...  12  ... NaN  NaN
9986  தொண்டன் இலங்கை, திருகோணமலையிலிருந்து 1970ம் ஆண...  15  ... NaN  NaN

[9987 rows x 7 columns]